# Напишите программу, которая принимает на вход цифру, обозначающую день недели,
# и проверяет, является ли этот день выходным.
# Пример:
# - 6 -> да
# - 7 -> да
# - 1 -> нет

# day_week = int(input('Введите цифру дня недели'))

# if day_week == 6 or 7:
#     print('Да,это день является выходным')
# else:
#     print('Нет, этот день не является выходным')


day_week = int(input('enter the number of the day of the week: '))

res = lambda day_week: day_week == 6 or 7


if res == True:
    print('Да,это день является выходным')
else:
    print('Нет, этот день не является выходным')